FILES/Catalogs/НоменклатураБТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>НоменклатураБТ</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяВМаршруте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СистемнаяНоменклатура</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПоставщика</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСервисногоСбора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНаценки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКомиссии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДСПоставщика</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДСКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКлиентаКакСуммаПоставщика</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомиссионнаяУслуга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Характеристики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.НаборХарактеристикДляНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранитьИсторию</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеОтображать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбязательноеЗаполнение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭмитироватьСправочник</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FILES/Catalogs/НоменклатураБТ/Ext/ManagerModule.bsl
Функция ПолучитьСтруктуруJSON(НоменклатураБТСсылка) Экспорт
	
	Результат = Новый Структура();
	//НоменклатураБТСсылка = Справочники.НоменклатураБТ.ПустаяСсылка();
	
	Для Каждого СтрокаСХарактеристикой ИЗ НоменклатураБТСсылка.Характеристики Цикл
		
		Если СтрокаСХарактеристикой.Характеристика.НаименованиеJSON <> "" Тогда
			Значение = СтрокаСХарактеристикой.Характеристика.НаименованиеJSON;
			Ключ = СтрокаСХарактеристикой.Характеристика;
			
			Результат.Вставить(Ключ, Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСтруктуруРеквизитов(НоменклатураБТСсылка) Экспорт
	
	Результат = Новый Структура();
	//НоменклатураБТСсылка = Справочники.НоменклатураБТ.ПустаяСсылка();
	
	Для Каждого СтрокаСХарактеристикой ИЗ НоменклатураБТСсылка.Характеристики Цикл
		
		Если СтрокаСХарактеристикой.Характеристика.НаименованиеJSON <> "" Тогда
			Ключ = СтрокаСХарактеристикой.Характеристика.НаименованиеJSON;
			Значение = СтрокаСХарактеристикой.Характеристика;
			
			Результат.Вставить(Ключ, Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции


Функция ЗагрузитьПредопределенныеЗначения() Экспорт
	
	Макет = Справочники.НоменклатураБТ.ПолучитьМакет("ПредопределенныеЗначения");
	
	ТекущаяСтрока = 1;
	ВыполнятьЗагрузку = Истина;
	Пока ВыполнятьЗагрузку Цикл
		ТекущаяСтрока = ТекущаяСтрока + 1;
		
		УникальныйИдентификатор			 = Макет.Область(ТекущаяСтрока, 1, ТекущаяСтрока, 1).Текст;
		Наименование					 = Макет.Область(ТекущаяСтрока, 2, ТекущаяСтрока, 2).Текст;
		НаименованиеТиповойНоменклатуры	 = Макет.Область(ТекущаяСтрока, 3, ТекущаяСтрока, 3).Текст;
		ИспользуетсяВМаршруте			 = Макет.Область(ТекущаяСтрока, 4, ТекущаяСтрока, 4).Текст;
		СистемнаяНоменклатура			 = Макет.Область(ТекущаяСтрока, 5, ТекущаяСтрока, 5).Текст;
		   
		Если УникальныйИдентификатор = "" Тогда
			ВыполнятьЗагрузку = Ложь;
		Иначе
			Попытка
				
				СпрСсылка = Справочники.НоменклатураБТ.ПолучитьСсылку(Новый УникальныйИдентификатор(УникальныйИдентификатор));
				СпрОбъект = СпрСсылка.ПолучитьОбъект();
				Если  СпрОбъект = Неопределено Тогда
					СпрОбъект = Справочники.НоменклатураБТ.СоздатьЭлемент();
					СпрОбъект.УстановитьСсылкуНового(СпрСсылка);
				КонецЕсли;
				
				СпрОбъект.Наименование = Наименование;
				СпрОбъект.СистемнаяНоменклатура = Булево(СистемнаяНоменклатура);
				СпрОбъект.ИспользуетсяВМаршруте = Булево(ИспользуетсяВМаршруте);
				
				//СпрОбъект.Характеристики.Очистить();                                                      
				
				ТекущаяКолонка = 5;
				ВыполнятьЗагрузкуКолонок = Истина;
				Пока ВыполнятьЗагрузкуКолонок Цикл
					ТекущаяКолонка = ТекущаяКолонка + 1;
					
					ЗначениеХарактеристики = Макет.Область(ТекущаяСтрока, ТекущаяКолонка, ТекущаяСтрока, ТекущаяКолонка).Текст;					
					
					Если ЗначениеХарактеристики = "" Тогда
						ВыполнятьЗагрузкуКолонок = Ложь;
					Иначе
						СтруктураЖС = УправлениеБТВызовСервера.ИзJSON(ЗначениеХарактеристики);
						ХарактеристикаСсылка = ПланыВидовХарактеристик.НаборХарактеристикДляНоменклатуры[СтруктураЖС.Характеристика];
						НайденнаяСтрока = СпрОбъект.Характеристики.НайтиСтроки(Новый Структура("Характеристика", ХарактеристикаСсылка));
						Если НайденнаяСтрока.Количество() = 0 Тогда  						
							НСТР = СпрОбъект.Характеристики.Добавить();
							НСТР.Характеристика = ХарактеристикаСсылка;
							НСТР.НеОтображать = Булево(СтруктураЖС.НеОтображать);
							НСТР.ОбязательноеЗаполнение = Булево(СтруктураЖС.ОбязательноеЗаполнение);
							НСТР.ХранитьИсторию = Булево(СтруктураЖС.ХранитьИсторию);
							НСТР.ЭмитироватьСправочник = Булево(СтруктураЖС.ЭмитироватьСправочник);
						//Иначе //???
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				
				Если НЕ ЗначениеЗаполнено(СпрОбъект.Номенклатура) Тогда
					СпрНоменклатура = Справочники.Номенклатура.НайтиПоНаименованию(Наименование,Истина);
					Если НЕ ЗначениеЗаполнено(СпрОбъект.Номенклатура) Тогда
						СпрНоменклатураОбъект = Справочники.Номенклатура.СоздатьЭлемент();
						СпрНоменклатураОбъект.Наименование = Наименование;
						СпрНоменклатураОбъект.ЕдиницаИзмерения = "шт.";
						СпрНоменклатураОбъект.Записать();
						СпрНоменклатура = СпрНоменклатураОбъект.Ссылка;
					КонецЕсли;
					СпрОбъект.Номенклатура = СпрНоменклатура;
				КонецЕсли;
				
				СпрОбъект.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
			
	КонецЦикла;
	
КонецФункции
